import { ISyntheticAccountsRecordsState } from './index';

export const syntheticAccountsInitialState: ISyntheticAccountsRecordsState = {
  syntheticAccounts: [
    {
      id: 10,
      number: 10,
      title: 'Основні засоби',
      description:
        'Рахунок 10 "Основні засоби" призначено для обліку й узагальнення інформації про наявність та рух власних або отриманих на умовах фінансової оренди об\'єктів і орендованих цілісних майнових комплексів, які віднесені до складу основних засобів, а також об\'єктів інвестиційної нерухомості.\n\nДо основних засобів належать матеріальні активи, які підприємство утримує з метою використання їх у процесі виробництва або постачання товарів і послуг, надання в оренду іншим особам або для здійснення адміністративних і соціально-культурних функцій, очікуваний строк корисного використання (експлуатації) яких більше одного року (або операційного циклу, якщо він довший за рік).\n\nМетодологічні засади формування в бухгалтерському обліку інформації про основні засоби визначені в Положенні (стандарті) бухгалтерського обліку 7 "Основні засоби".\n\nЗа дебетом рахунку 10 "Основні засоби" відображається надходження (придбаних, створених, безоплатно отриманих) основних засобів на баланс підприємства, які обліковуються за первісною вартістю, сума витрат, яка пов\'язана з поліпшенням об\'єкта (модернізація, модифікація, добудова, дообладнання, реконструкція тощо), що призводить до збільшення майбутніх економічних вигод, первісно очікуваних від використання об\'єкта; сума дооцінки вартості об\'єкта основних засобів, за кредитом - вибуття основних засобів внаслідок продажу, безоплатної передачі або невідповідності критеріям визнання активом, а також у разі часткової ліквідації об\'єкта основних засобів, сума уцінки основних засобів. За дебетом рахунку 10 "Основні засоби" також відображається сума створеного забезпечення, зокрема на передбачену законодавством рекультивацію порушених земель.\n\nАналітичний облік основних засобів ведеться щодо кожного об\'єкту окремо.',
      accountId: 1,
      byDebitAccounts: [
        {
          id: 13,
          number: 13,
          title: 'Знос (амортизація) необоротних активів',
          description:
            'Рахунок 13 "Знос необоротних активів" призначено для узагальнення інформації про нараховану амортизацію та індексацію зносу (накопиченої амортизації) необоротних матеріальних і нематеріальних активів, що підлягають амортизації.\n\nАналітичний облік зносу (накопиченої амортизації) необоротних активів ведеться відповідно за видами основних засобів, інших матеріальних необоротних активів та нематеріальних активів. На субрахунку 134 "Накопичена амортизація довгострокових біологічних активів" узагальнюється інформація про суму амортизації, нарахованої на довгострокові біологічні активи, облік яких ведеться на субрахунках 162 "Довгострокові біологічні активи рослинництва, які оцінені за первісною вартістю" та 164 "Довгострокові біологічні активи тваринництва, які оцінені за первісною вартістю.',
          accountId: 1
        },
        {
          id: 15,
          number: 15,
          title: 'Капітальні інвестиції',
          description:
            'Рахунок 15 "Капітальні інвестиції" призначений для обліку витрат на придбання або створення матеріальних і нематеріальних необоротних активів.',
          accountId: 1
        },
        {
          id: 16,
          number: 16,
          title: 'Довгострокові біологічні активи',
          description:
            'Рахунок 16 "Довгострокові біологічні активи" призначено для обліку й узагальнення інформації про наявність та рух власних або отриманих на умовах фінансової оренди довгострокових біологічних активів, крім плодоносних рослин, які обліковуються на рахунку 10 "Основні засоби".\nДо довгострокових біологічних активів належать біологічні активи, здатні давати сільськогосподарську продукцію та/або додаткові біологічні активи або в інший спосіб приносити економічні вигоди протягом періоду, що перевищує 12 місяців (або операційний цикл, якщо він більше 12 місяців), та біологічні активи, що створюються протягом періоду, більшого ніж один рік, за винятком тварин на вирощуванні і відгодівлі.\n\nМетодологічні засади формування в бухгалтерському обліку інформації про довгострокові біологічні активи, про одержані від їх біологічних перетворень додаткові біологічні активи і сільськогосподарську продукцію визначаються <a href="https://zakon.rada.gov.ua/laws/show/z1456-05">Положенням (стандартом) бухгалтерського обліку 30 "Біологічні активи"</a>.\n\nЗа дебетом рахунку 16 "Довгострокові біологічні активи" відображається надходження довгострокових біологічних активів, за кредитом - їх вибуття.',
          accountId: 1
        },
        {
          id: 18,
          number: 18,
          title:
            'Довгострокова дебіторська заборгованість та інші необоротні активи',
          description:
            'Рахунок 18 "Довгострокова дебіторська заборгованість та інші необоротні активи" призначено для обліку дебіторської заборгованості фізичних та юридичних осіб, яка не виникає в ході нормального операційного циклу та буде погашена після дванадцяти місяців з дати балансу, для обліку активів, використання яких, як очікується, неможливо протягом дванадцяти місяців з дати балансу, а також для обліку інших необоротних активів, які не знайшли безпосереднього відображення на інших рахунках обліку необоротних активів.\n\nЗа дебетом рахунку 18 "Довгострокова дебіторська заборгованість та інші необоротні активи" відображається виникнення (збільшення) довгострокової дебіторської заборгованості та одержання інших необоротних активів, за кредитом - погашення (списання) довгострокової дебіторської заборгованості та вибуття інших необоротних активів.\n\nАналітичний облік довгострокової дебіторської заборгованості та інших необоротних активів ведеться за кожним дебітором, за видами заборгованості, термінами її виникнення й погашення, за видами інших необоротних активів.',
          accountId: 1
        }
      ],
      byCreditAccounts: [
        {
          id: 18,
          number: 18,
          title:
            'Довгострокова дебіторська заборгованість та інші необоротні активи',
          description:
            'Рахунок 18 "Довгострокова дебіторська заборгованість та інші необоротні активи" призначено для обліку дебіторської заборгованості фізичних та юридичних осіб, яка не виникає в ході нормального операційного циклу та буде погашена після дванадцяти місяців з дати балансу, для обліку активів, використання яких, як очікується, неможливо протягом дванадцяти місяців з дати балансу, а також для обліку інших необоротних активів, які не знайшли безпосереднього відображення на інших рахунках обліку необоротних активів.\n\nЗа дебетом рахунку 18 "Довгострокова дебіторська заборгованість та інші необоротні активи" відображається виникнення (збільшення) довгострокової дебіторської заборгованості та одержання інших необоротних активів, за кредитом - погашення (списання) довгострокової дебіторської заборгованості та вибуття інших необоротних активів.\n\nАналітичний облік довгострокової дебіторської заборгованості та інших необоротних активів ведеться за кожним дебітором, за видами заборгованості, термінами її виникнення й погашення, за видами інших необоротних активів.',
          accountId: 1
        },
        {
          id: 16,
          number: 16,
          title: 'Довгострокові біологічні активи',
          description:
            'Рахунок 16 "Довгострокові біологічні активи" призначено для обліку й узагальнення інформації про наявність та рух власних або отриманих на умовах фінансової оренди довгострокових біологічних активів, крім плодоносних рослин, які обліковуються на рахунку 10 "Основні засоби".\nДо довгострокових біологічних активів належать біологічні активи, здатні давати сільськогосподарську продукцію та/або додаткові біологічні активи або в інший спосіб приносити економічні вигоди протягом періоду, що перевищує 12 місяців (або операційний цикл, якщо він більше 12 місяців), та біологічні активи, що створюються протягом періоду, більшого ніж один рік, за винятком тварин на вирощуванні і відгодівлі.\n\nМетодологічні засади формування в бухгалтерському обліку інформації про довгострокові біологічні активи, про одержані від їх біологічних перетворень додаткові біологічні активи і сільськогосподарську продукцію визначаються <a href="https://zakon.rada.gov.ua/laws/show/z1456-05">Положенням (стандартом) бухгалтерського обліку 30 "Біологічні активи"</a>.\n\nЗа дебетом рахунку 16 "Довгострокові біологічні активи" відображається надходження довгострокових біологічних активів, за кредитом - їх вибуття.',
          accountId: 1
        },
        {
          id: 13,
          number: 13,
          title: 'Знос (амортизація) необоротних активів',
          description:
            'Рахунок 13 "Знос необоротних активів" призначено для узагальнення інформації про нараховану амортизацію та індексацію зносу (накопиченої амортизації) необоротних матеріальних і нематеріальних активів, що підлягають амортизації.\n\nАналітичний облік зносу (накопиченої амортизації) необоротних активів ведеться відповідно за видами основних засобів, інших матеріальних необоротних активів та нематеріальних активів. На субрахунку 134 "Накопичена амортизація довгострокових біологічних активів" узагальнюється інформація про суму амортизації, нарахованої на довгострокові біологічні активи, облік яких ведеться на субрахунках 162 "Довгострокові біологічні активи рослинництва, які оцінені за первісною вартістю" та 164 "Довгострокові біологічні активи тваринництва, які оцінені за первісною вартістю.',
          accountId: 1
        }
      ]
    },
    {
      id: 23,
      number: 55,
      title: 'teshdft',
      description: 'test description1',
      accountId: 1,
      byDebitAccounts: [
        {
          id: 1,
          number: 1,
          title: 'Орендовані необоротні активи',
          description:
            'На цьому рахунку обліковуються активи у вигляді основних засобів, нематеріальних активів, зокрема отримане у користування авторське право та суміжні з ним права, за користування якими сплачується роялті, та інших необоротних активів, що отримані підприємством на підставі відповідних договорів, зокрема, але не виключно оренди (лізингу), та обліковуються на балансі орендодавця.\n\nОблік отриманих в оренду активів здійснюється за видами активів.\n\nПрийняті в оперативну оренду основні засоби і нематеріальні активи зараховуються на позабалансовий рахунок 01 "Орендовані необоротні активи" за балансовою (залишковою) і первісною вартістю орендодавця, що зазначається в договорі операційної оренди.\n\nЗбільшення залишку рахунку 01 "Орендовані необоротні активи" відбувається при прийнятті на облік основних засобів, нематеріальних активів, та інших необоротних активів, що отримані в оперативну оренду, зменшення - при їх поверненні орендодавцю та у випадках перенесення заборгованості перед орендодавцем за орендовані необоротні активи на баланс.\n\nАналітичний облік орендованих необоротних активів ведеться за видами активів.',
          accountId: 10
        },
        {
          id: 7,
          number: 7,
          title: 'Списані активи',
          description:
            'Рахунок 07 "Списані активи" призначено для узагальнення інформації про стан дебіторської заборгованості, списаної з балансу внаслідок неплатоспроможності боржників, та про суми невідшкодованих нестач і втрат від псування цінностей.\n\nЗарахування на позабалансовий рахунок 07 суми здійснюється одночасно зі списанням суми нестач і втрат від псування цінностей та дебіторської заборгованості на витрати підприємства.\n\nАналітичний облік за позабалансовим рахунком 07 "Списані активи" ведеться за боржниками та випадками встановлення нестач і втрат від псування цінностей.',
          accountId: 10
        }
      ],
      byCreditAccounts: [
        {
          id: 3,
          number: 3,
          title: "Контрактні зобов'язання",
          description:
            "Цей рахунок призначений для узагальнення інформації про наявність та рух зобов'язань по укладених контрактах, а також контролю за їх виконанням.\n\nНа рахунку 03 \"Контрактні зобов'язання\" ведеться облік по деривативах (форвардних і ф'ючерсних контрактах, опціонах) та інших контрактах, розкриття інформації щодо яких передбачено відповідними положеннями (стандартами) бухгалтерського обліку. Дериватив - стандартний документ, що засвідчує право або зобов'язання придбати або продати цінні папери, матеріальні або нематеріальні активи, а також кошти на визначених ним умовах у майбутньому. Відповідно до виду цінностей деривативи розподіляються на фондові, валютні, товарні.\n\nОблік зобов'язань здійснюється в оцінці, передбаченій контрактами.\n\nСписуються контрактні зобов'язання з рахунку у разі виконання, ліквідації, відмови від виконання, передачі або продажу зобов'язання за контрактом іншим особам.\n\nАналітичний облік ведеться за видами зобов'язань.",
          accountId: 10
        },
        {
          id: 4,
          number: 4,
          title: "Непередбачені активи й зобов'язання",
          description:
            "Рахунок 04 \"Непередбачені активи й зобов'язання\" використовується для накопичення інформації про наявність непередбачених (потенційних) активів та непередбачених (потенційних) зобов'язань. Ці активи або зобов'язання виникли при узгодженні минулих господарських операцій та стануть реальними, якщо відбудеться або не відбудеться в майбутньому одна чи кілька невизначених подій. Це визначення включає три основних характеристики непередбачених активів та зобов'язань: 1) наявна обставина; 2) невизначеність кінцевого результату цієї обставини; 3) вирішення невизначеності на основі однієї або кількох майбутніх подій.\n\nІнформація про існування таких активів та зобов'язань необхідна для розкриття її в примітках до фінансових звітів. Загальні методологічні принципи обліку, подання та розкриття потенційних активів та зобов'язань підприємства викладені в <a href=\"https://zakon.rada.gov.ua/laws/show/z0085-00\">Положенні (стандарті) бухгалтерського обліку 11 \"Зобов'язання\"</a>.",
          accountId: 10
        }
      ]
    },
    {
      id: 17,
      number: 17,
      title: 'Відстрочені податкові активи',
      description:
        'На рахунку 17 "Відстрочені податкові активи" ведеться облік суми податків на прибуток, що підлягає відшкодуванню в наступних звітних періодах внаслідок:\n\nтимчасові різниці між балансовою вартістю активів або зобов\'язань та оцінкою цих активів або зобов\'язань, яка використовується з метою оподаткування;\n\nперенесення податкових збитків, не використаних для зменшення податку на прибуток у звітному періоді.\n\nЗа дебетом рахунку 17 "Відстрочені податкові активи" відображається сума перевищення податку на прибуток, що підлягає сплаті в поточному звітному періоді, над витратами, пов\'язаними з нарахуванням податку на прибуток у поточному звітному періоді, за кредитом - зменшення відстрочених податкових активів за рахунок витрат, пов\'язаних з нарахуванням податків на прибуток у поточному звітному періоді.\n\nСума відстроченого податкового активу визначається згідно з <a href="https://zakon.rada.gov.ua/laws/show/z0047-01">Положенням (стандартом) бухгалтерського обліку 17 "Податок на прибуток"</a>. Аналітичний облік відстрочених податкових активів ведеться за видами активів або зобов\'язань, між оцінками яких для відображення в балансі та з метою оподаткування виникла різниця.',
      accountId: 1,
      byDebitAccounts: [],
      byCreditAccounts: []
    },
    {
      id: 15,
      number: 15,
      title: 'Капітальні інвестиції',
      description:
        'Рахунок 15 "Капітальні інвестиції" призначений для обліку витрат на придбання або створення матеріальних і нематеріальних необоротних активів.',
      accountId: 1,
      byDebitAccounts: [],
      byCreditAccounts: []
    },
    {
      id: 6,
      number: 6,
      title: 'Гарантії та забезпечення отримані',
      description:
        'Рахунок 06 "Гарантії та забезпечення отримані" передбачено для узагальнення інформації про наявність та рух отриманих гарантій та забезпечень виконання зобов\'язань та платежів.\n\nОблік забезпечення провадиться за вартістю, вказаною в документах про гарантії та забезпечення. Зокрема, на цьому рахунку обліковуються:\n\nгарантії, отримані підприємством за третіх осіб;\n\nвартість товарно-матеріальних цінностей, основних засобів та цінних паперів (які знаходяться як на підприємстві, так і в депозиті нотаріальної контори чи банку), що становлять предмет застави;\n\nвартість інших гарантій та забезпечень.\n\nАналітичний облік гарантій та забезпечень ведеться за кожною отриманою гарантією та забезпеченням.\n\nЗбільшення залишку на рахунку 06 "Гарантії та забезпечення отримані" відбувається при одержані гарантій та забезпечень, зменшення - при їх списанні внаслідок погашення заборгованості, на яку були вони надані, та при перенесені заборгованості за ними на баланс.',
      accountId: 10,
      byDebitAccounts: [],
      byCreditAccounts: []
    },
    {
      id: 11,
      number: 11,
      title: 'Інші необоротні матеріальні активи',
      description:
        "Рахунок 11 \"Інші необоротні матеріальні активи\" призначено для обліку та узагальнення інформації про наявність та рух інших необоротних матеріальних активів, які не відображені у складі об'єктів обліку на рахунку 10 \"Основні засоби\".\n\nЗа дебетом рахунку 11 \"Інші необоротні матеріальні активи\" відображається надходження (придбаних, створених, безоплатно отриманих інших необоротних матеріальних активів на підприємство (за первісною вартістю); сума витрат, яка пов'язана з поліпшенням об'єкта (реконструкція, модернізація), що приводить до збільшення майбутніх економічних вигод, первісно очікуваних від використання об'єкта; сума дооцінки вартості об'єкта необоротних матеріальних активів. За кредитом рахунку 11 відображаються вибуття інших необоротних матеріальних активів внаслідок продажу, безоплатної передачі або невідповідності критеріям визнання активом, а також у разі часткової ліквідації об'єкта та сума їх уцінки.\n\nАналітичний облік необоротних матеріальних активів ведеться щодо кожного об'єкта цих активів. Підприємства, які амортизацію бібліотечних фондів і малоцінних необоротних матеріальних активів нараховують у першому місяці використання зазначених об'єктів у розмірі 100 відсотків їх вартості, аналітичний облік цих об'єктів можуть вести із забезпеченням інформації про загальну кількість об'єктів та їх загальну вартість у розрізі класифікаційних підгруп, що підприємство запроваджує самостійно. Вартість об'єкта таких підгруп при його вибутті визначається діленням вартості відповідної підгрупи, що обліковується на субрахунках 111 і 112, на кількість об'єктів, що входять до складу відповідної підгрупи, з відображенням за кредитом субрахунків 111 і 112 у кореспонденції з дебетом субрахунку 132.",
      accountId: 1,
      byDebitAccounts: [],
      byCreditAccounts: []
    },
    {
      id: 12,
      number: 12,
      title: 'Нематеріальні активи',
      description:
        'Рахунок 12 "Нематеріальні активи" призначений для обліку та узагальнення інформації про наявність та рух нематеріальних активів.\n\nДо нематеріальних активів належать немонетарні активи, які не мають матеріальної форми, можуть бути ідентифіковані та утримуватися підприємством з метою використання протягом періоду більше одного року (або одного операційного циклу, якщо він перевищує 1 рік) для виробництва, торгівлі, адміністративних потреб чи надання в оренду іншим особам.\n\nМетодологічні засади формування в бухгалтерському обліку інформації про нематеріальні активи та розкриття інформації про них у фінансовій звітності визначає <a href="https://zakon.rada.gov.ua/laws/show/z0750-99">Положення (стандарт) бухгалтерського обліку 8 "Нематеріальні активи"</a>.\n\nЗа дебетом рахунку 12 "Нематеріальні активи" відображається придбання або отримання в результаті розробки (від інших фізичних або юридичних осіб) нематеріальних активів, які обліковуються за первісною вартістю, та сума дооцінки таких активів, за кредитом - вибуття внаслідок продажу, безоплатної передачі або неможливості отримання підприємством надалі економічних вигод від його використання та сума уцінки нематеріальних активів.',
      accountId: 1,
      byDebitAccounts: [],
      byCreditAccounts: []
    },
    {
      id: 5,
      number: 5,
      title: 'Гарантії та забезпечення надані',
      description:
        'Рахунок 05 "Гарантії та забезпечення надані" передбачено для узагальнення інформації про наявність та рух виданих підприємством гарантій та забезпечень виконання як власних зобов\'язань та платежів',
      accountId: 10,
      byDebitAccounts: [],
      byCreditAccounts: []
    },
    {
      id: 1,
      number: 1,
      title: 'Орендовані необоротні активи',
      description:
        'На цьому рахунку обліковуються активи у вигляді основних засобів, нематеріальних активів, зокрема отримане у користування авторське право та суміжні з ним права, за користування якими сплачується роялті, та інших необоротних активів, що отримані підприємством на підставі відповідних договорів, зокрема, але не виключно оренди (лізингу), та обліковуються на балансі орендодавця.\n\nОблік отриманих в оренду активів здійснюється за видами активів.\n\nПрийняті в оперативну оренду основні засоби і нематеріальні активи зараховуються на позабалансовий рахунок 01 "Орендовані необоротні активи" за балансовою (залишковою) і первісною вартістю орендодавця, що зазначається в договорі операційної оренди.\n\nЗбільшення залишку рахунку 01 "Орендовані необоротні активи" відбувається при прийнятті на облік основних засобів, нематеріальних активів, та інших необоротних активів, що отримані в оперативну оренду, зменшення - при їх поверненні орендодавцю та у випадках перенесення заборгованості перед орендодавцем за орендовані необоротні активи на баланс.\n\nАналітичний облік орендованих необоротних активів ведеться за видами активів.',
      accountId: 10,
      byDebitAccounts: [],
      byCreditAccounts: []
    },
    {
      id: 9,
      number: 9,
      title: 'Амортизаційні відрахування',
      description:
        'На цьому рахунку ведеться облік нарахування та використання амортизаційних відрахувань.\n\nЗбільшення залишку на рахунку 09 "Амортизаційні відрахування" (надходження) відбувається на суму нарахованої амортизації необоротних активів.\n\nЗменшення залишку на рахунку 09 відображається на суму використаної амортизації на капітальні інвестиції, на погашення отриманих на капітальні інвестиції позик тощо. При визначенні суми використаних амортизаційних відрахувань не враховуються капітальні інвестиції, здійснені за рахунок бюджетних інвестиційних асигнувань, цільових коштів, внесків до статутного (пайового) фонду (капіталу) підприємства тощо.\n\nАналітичний облік ведеться, зокрема, за такими напрямками використання амортизації на:\n\nбудівництво об\'єктів;\n\nпридбання (виготовлення) основних засобів;\n\nполіпшення (модернізація, модифікація, добудова, дообладнання, реконструкція тощо) основних засобів;\n\nпридбання (створення) нематеріальних активів;\n\nінші капітальні роботи;\n\nпогашення отриманих на капітальні інвестиції позик.',
      accountId: 10,
      byDebitAccounts: [],
      byCreditAccounts: []
    },
    {
      id: 8,
      number: 8,
      title: 'Бланки суворого обліку',
      description:
        'На цьому рахунку ведеться облік наявності та руху бланків суворого обліку та суворої звітності, зокрема бланків документів, що засвідчують особу, подію, право, освіту, трудовий стаж тощо (свідоцтва, посвідчення, трудова книжка, дипломи про освіту та інші); проїзних документів (квитки на проїзд, абонементні талони, документи на перевезення вантажів та інші).\n\nПерелік документів, які відносяться до бланків суворого обліку та суворої звітності, порядок їх зберігання й використання встановлюються відповідними нормативно-правовими актами.\n\nЗбільшення залишку рахунку 08 "Бланки суворого обліку" відбувається при надходженні (прийнятті на облік) бланків суворого обліку, зменшення - після використання або списання як непридатних чи таких, що не є в наявності.\n\nАналітичний облік ведеться за кожним бланком та місцями їх зберігання.',
      accountId: 10,
      byDebitAccounts: [],
      byCreditAccounts: []
    },
    {
      id: 7,
      number: 7,
      title: 'Списані активи',
      description:
        'Рахунок 07 "Списані активи" призначено для узагальнення інформації про стан дебіторської заборгованості, списаної з балансу внаслідок неплатоспроможності боржників, та про суми невідшкодованих нестач і втрат від псування цінностей.\n\nЗарахування на позабалансовий рахунок 07 суми здійснюється одночасно зі списанням суми нестач і втрат від псування цінностей та дебіторської заборгованості на витрати підприємства.\n\nАналітичний облік за позабалансовим рахунком 07 "Списані активи" ведеться за боржниками та випадками встановлення нестач і втрат від псування цінностей.',
      accountId: 10,
      byDebitAccounts: [],
      byCreditAccounts: []
    },
    {
      id: 18,
      number: 18,
      title:
        'Довгострокова дебіторська заборгованість та інші необоротні активи',
      description:
        'Рахунок 18 "Довгострокова дебіторська заборгованість та інші необоротні активи" призначено для обліку дебіторської заборгованості фізичних та юридичних осіб, яка не виникає в ході нормального операційного циклу та буде погашена після дванадцяти місяців з дати балансу, для обліку активів, використання яких, як очікується, неможливо протягом дванадцяти місяців з дати балансу, а також для обліку інших необоротних активів, які не знайшли безпосереднього відображення на інших рахунках обліку необоротних активів.\n\nЗа дебетом рахунку 18 "Довгострокова дебіторська заборгованість та інші необоротні активи" відображається виникнення (збільшення) довгострокової дебіторської заборгованості та одержання інших необоротних активів, за кредитом - погашення (списання) довгострокової дебіторської заборгованості та вибуття інших необоротних активів.\n\nАналітичний облік довгострокової дебіторської заборгованості та інших необоротних активів ведеться за кожним дебітором, за видами заборгованості, термінами її виникнення й погашення, за видами інших необоротних активів.',
      accountId: 1,
      byDebitAccounts: [],
      byCreditAccounts: []
    },
    {
      id: 2,
      number: 2,
      title: 'Активи на відповідальному зберіганні',
      description:
        'Рахунок 02 "Активи на відповідальному зберіганні" призначено для обліку цінностей, які тимчасово знаходяться на підприємстві та не є його власністю, прийняті на комісію, у переробку, до монтажу, в довірче управління. Облік цих цінностей ведеться за цінами, що передбачені в договорах, приймально-передавальних актах тощо. Усі товарно-матеріальні цінності, що обліковуються на цьому рахунку, інвентаризуються в порядку і строки, передбачені для власних цінностей.',
      accountId: 10,
      byDebitAccounts: [],
      byCreditAccounts: []
    },
    {
      id: 13,
      number: 13,
      title: 'Знос (амортизація) необоротних активів',
      description:
        'Рахунок 13 "Знос необоротних активів" призначено для узагальнення інформації про нараховану амортизацію та індексацію зносу (накопиченої амортизації) необоротних матеріальних і нематеріальних активів, що підлягають амортизації.\n\nАналітичний облік зносу (накопиченої амортизації) необоротних активів ведеться відповідно за видами основних засобів, інших матеріальних необоротних активів та нематеріальних активів. На субрахунку 134 "Накопичена амортизація довгострокових біологічних активів" узагальнюється інформація про суму амортизації, нарахованої на довгострокові біологічні активи, облік яких ведеться на субрахунках 162 "Довгострокові біологічні активи рослинництва, які оцінені за первісною вартістю" та 164 "Довгострокові біологічні активи тваринництва, які оцінені за первісною вартістю.',
      accountId: 1,
      byDebitAccounts: [],
      byCreditAccounts: []
    },
    {
      id: 19,
      number: 19,
      title: 'Гудвіл',
      description:
        'Рахунок 19 "Гудвіл" призначений для узагальнення інформації про гудвіл, що виникає при придбанні, відповідно до Положення (стандарту) бухгалтерського обліку 19 "Об\'єднання підприємств", та/або гудвіл, який виник у процесі приватизації (корпоратизації) підприємства, порядок обліку та списання якого визначається Положенням про порядок бухгалтерського обліку окремих активів та операцій підприємств державного, комунального секторів економіки та господарських організацій, які володіють та/або користуються об\'єктами державної, комунальної власності, затвердженим наказом Міністерства фінансів України від 19.12.2006 № 1213.\n\nАналітичний облік гудвілу ведеться за об\'єктами придбання.',
      accountId: 1,
      byDebitAccounts: [],
      byCreditAccounts: []
    },
    {
      id: 16,
      number: 16,
      title: 'Довгострокові біологічні активи',
      description:
        'Рахунок 16 "Довгострокові біологічні активи" призначено для обліку й узагальнення інформації про наявність та рух власних або отриманих на умовах фінансової оренди довгострокових біологічних активів, крім плодоносних рослин, які обліковуються на рахунку 10 "Основні засоби".\nДо довгострокових біологічних активів належать біологічні активи, здатні давати сільськогосподарську продукцію та/або додаткові біологічні активи або в інший спосіб приносити економічні вигоди протягом періоду, що перевищує 12 місяців (або операційний цикл, якщо він більше 12 місяців), та біологічні активи, що створюються протягом періоду, більшого ніж один рік, за винятком тварин на вирощуванні і відгодівлі.\n\nМетодологічні засади формування в бухгалтерському обліку інформації про довгострокові біологічні активи, про одержані від їх біологічних перетворень додаткові біологічні активи і сільськогосподарську продукцію визначаються <a href="https://zakon.rada.gov.ua/laws/show/z1456-05">Положенням (стандартом) бухгалтерського обліку 30 "Біологічні активи"</a>.\n\nЗа дебетом рахунку 16 "Довгострокові біологічні активи" відображається надходження довгострокових біологічних активів, за кредитом - їх вибуття.',
      accountId: 1,
      byDebitAccounts: [],
      byCreditAccounts: []
    },
    {
      id: 4,
      number: 4,
      title: "Непередбачені активи й зобов'язання",
      description:
        "Рахунок 04 \"Непередбачені активи й зобов'язання\" використовується для накопичення інформації про наявність непередбачених (потенційних) активів та непередбачених (потенційних) зобов'язань. Ці активи або зобов'язання виникли при узгодженні минулих господарських операцій та стануть реальними, якщо відбудеться або не відбудеться в майбутньому одна чи кілька невизначених подій. Це визначення включає три основних характеристики непередбачених активів та зобов'язань: 1) наявна обставина; 2) невизначеність кінцевого результату цієї обставини; 3) вирішення невизначеності на основі однієї або кількох майбутніх подій.\n\nІнформація про існування таких активів та зобов'язань необхідна для розкриття її в примітках до фінансових звітів. Загальні методологічні принципи обліку, подання та розкриття потенційних активів та зобов'язань підприємства викладені в <a href=\"https://zakon.rada.gov.ua/laws/show/z0085-00\">Положенні (стандарті) бухгалтерського обліку 11 \"Зобов'язання\"</a>.",
      accountId: 10,
      byDebitAccounts: [],
      byCreditAccounts: []
    },
    {
      id: 3,
      number: 3,
      title: "Контрактні зобов'язання",
      description:
        "Цей рахунок призначений для узагальнення інформації про наявність та рух зобов'язань по укладених контрактах, а також контролю за їх виконанням.\n\nНа рахунку 03 \"Контрактні зобов'язання\" ведеться облік по деривативах (форвардних і ф'ючерсних контрактах, опціонах) та інших контрактах, розкриття інформації щодо яких передбачено відповідними положеннями (стандартами) бухгалтерського обліку. Дериватив - стандартний документ, що засвідчує право або зобов'язання придбати або продати цінні папери, матеріальні або нематеріальні активи, а також кошти на визначених ним умовах у майбутньому. Відповідно до виду цінностей деривативи розподіляються на фондові, валютні, товарні.\n\nОблік зобов'язань здійснюється в оцінці, передбаченій контрактами.\n\nСписуються контрактні зобов'язання з рахунку у разі виконання, ліквідації, відмови від виконання, передачі або продажу зобов'язання за контрактом іншим особам.\n\nАналітичний облік ведеться за видами зобов'язань.",
      accountId: 10,
      byDebitAccounts: [],
      byCreditAccounts: []
    },
    {
      id: 14,
      number: 14,
      title: 'Довгострокові фінансові інвестиції',
      description:
        'Рахунок 14 "Довгострокові фінансові інвестиції" призначений для узагальнення інформації про наявність та рух довгострокових інвестицій (вкладень) у цінні папери інших підприємств, облігації державних та місцевих позик, статутний капітал інших підприємств, створених на території країни та за кордоном, тощо.\n\nАналітичний облік за рахунком 14 "Довгострокові фінансові інвестиції" ведеться за видами довгострокових фінансових вкладень та об\'єктами інвестування. При цьому побудова аналітичного обліку повинна забезпечити можливість отримання інформації про довгострокові фінансові вкладення в об\'єкти як на території країни, так і за кордоном.',
      accountId: 1,
      byDebitAccounts: [],
      byCreditAccounts: []
    }
  ],
  syntheticAccountRequestStatus: 'idle'
};
