import { IAccountsRecordsState } from './index';

export const accountsInitialState: IAccountsRecordsState = {
  accounts: [
    {
      id: 1,
      number: 1,
      title: 'Необоротні активи',
      description:
        "Рахунки цього класу призначені для узагальнення інформації про наявність і рух основних засобів, інших необоротних матеріальних активів, нематеріальних активів, довгострокових фінансових інвестицій, капітальних інвестицій, довгострокової дебіторської заборгованості та інших необоротних активів, а також зносу необоротних активів.\n\nНа рахунках цього класу з відповідним веденням аналітичного обліку узагальнюється інформація про наявність і рух необоротних активів, належних підприємству на праві власності, отриманих на праві господарського відання, на праві оперативного управління, отриманих у фінансовий лізинг, у довірче управління чи за договором оренди цілісного майнового комплексу. Господарські організації (крім державних (казенних) та комунальних підприємств) на окремих субрахунках третього порядку відповідних субрахунків із зазначенням належності до державної та/або комунальної власності відображають контрольовані ними (що перебувають у їх володінні та/або користуванні) необоротні активи, що є об'єктами права державної або комунальної власності, і які не увійшли до статутних капіталів господарських товариств, створених у процесі приватизації (корпоратизації)."
    },
    {
      id: 2,
      number: 2,
      title: 'Запаси',
      description:
        'Рахунки цього класу призначені для узагальнення інформації про наявність і рух належних підприємству готової продукції, товарів, предметів праці, що призначені для обробки, переробки, використання у виробництві і для господарських потреб, а також засобів праці, які підприємство включає до складу малоцінних та швидкозношуваних предметів.\n\nМатеріальні цінності, що прийняті підприємством на відповідальне зберігання, переробку (давальницька сировина), комісію, обліковуються на рахунках класу 0 "Позабалансові рахунки".\n\nГотова продукція, товари, виробничі запаси тощо, що відвантажені, до переходу покупцеві ризиків і вигод, пов\'язаних з правом власності на них, відображаються на окремих субрахунках відповідних рахунків обліку запасів.'
    },
    {
      id: 3,
      number: 3,
      title: 'Кошти, розрахунки та інші активи',
      description:
        'Рахунки цього класу призначені для узагальнення інформації про наявність і рух грошових коштів (у національній та іноземній валюті у касах, на розрахункових (поточних), валютних та інших рахунках у банках), електронних грошей, грошових документів, короткострокових векселів одержаних і фінансових інвестицій, дебіторської заборгованості, резерву сумнівних боргів і витрат майбутніх періодів.'
    },
    {
      id: 4,
      number: 4,
      title: "Власний капітал та забезпечення зобов'язань",
      description:
        "Рахунки цього класу призначені для узагальнення інформації про стан і рух коштів різновидностей власного капіталу - статутного, пайового, у дооцінках, додаткового, резервного, вилученого, неоплаченого, а також нерозподілених прибутків (непокритих збитків), цільових надходжень, забезпечень майбутніх витрат і платежів, страхових резервів.\n\nПорядок узагальнення інформації про стан і рух коштів окремих складових власного капіталу підприємствами державного та комунального секторів економіки визначається Положенням про порядок бухгалтерського обліку окремих активів та операцій підприємств державного, комунального секторів економіки та господарських організацій, які володіють та/або користуються об'єктами державної, комунальної власності, затвердженим наказом Міністерства фінансів України від 19.12.2006 № 1213."
    },
    {
      id: 5,
      number: 5,
      title: "Довгострокові зобов'язання",
      description:
        "Рахунки цього класу призначені для обліку даних та узагальнення інформації про: заборгованість підприємства банкам за отриманими від них кредитами, яка не є поточним зобов'язанням (заборгованість, яка не підлягає погашенню протягом операційного циклу підприємства або протягом дванадцяти місяців з дати балансу); заборгованість підприємства щодо зобов'язань із залученням позикових коштів (крім кредитів банків), суму податку на прибуток, що підлягають сплаті в майбутніх періодах внаслідок тимчасової різниці між обліковою та податковою базами оцінки; заборгованість за виданими довгостроковими векселями й розповсюдженими облігаціями.\n\nДовгострокові зобов'язання відображаються на рахунках бухгалтерського обліку, якщо їх оцінка може бути достовірно визначена та існує ймовірність зменшення економічних вигод у майбутньому внаслідок їх погашення."
    },
    {
      id: 6,
      number: 6,
      title: "Поточні зобов'язання",
      description:
        "Рахунки цього класу призначені для обліку даних та узагальнення інформації про зобов'язання, які будуть погашені у звичайному ході операційного циклу підприємства або повинні бути погашені протягом дванадцяти місяців з дати балансу.\n\nНа рахунках цього класу ведеться облік короткострокових позик, довгострокових зобов'язань, що стали поточною заборгованістю із строком погашення на дату балансу не більше дванадцяти місяців, короткострокових векселів виданих, розрахунків з постачальниками та підрядниками, розрахунків з податків і платежів, розрахунків за страхуванням, розрахунків з оплати праці, розрахунків з учасниками, а також інших розрахунків та операцій, доходів майбутніх періодів.\n\nНа окремих субрахунках синтетичних рахунків 63, 64, 65, 68 сальдо на кінець місяця може бути не лише кредитовим, але й дебетовим. Такі показники не згортаються, а сальдо синтетичного рахунку визначається розгорнуто за дебетом і кредитом як сума відповідного сальдо на субрахунках."
    },
    {
      id: 7,
      number: 7,
      title: 'Доходи і результати діяльності',
      description:
        'Рахунки класу 7 "Доходи і результати діяльності" призначені для узагальнення інформації про доходи від операційної, інвестиційної і фінансової діяльності підприємства. Склад доходів та порядок їх визнання визначаються відповідними положеннями (стандартами) бухгалтерського обліку.\n\nНа рахунках цього класу, крім рахунку 76 "Страхові платежі", протягом звітного року за кредитом відображається сума загального доходу разом із сумою непрямих податків, зборів (обов\'язкових платежів), що включені до ціни продажу, за дебетом - щомісячне відображення належної суми непрямих податків, зборів (обов\'язкових платежів), щорічне або щомісячне віднесення суми чистого доходу на рахунок 79 "Фінансові результати".\n\nНа рахунку 76 "Страхові платежі" узагальнюється інформація про надходження страхових платежів та їх повернення страхувальникам, із щомісячним віднесенням всієї різниці на субрахунок 703 "Дохід від реалізації робіт і послуг".'
    },
    {
      id: 9,
      number: 9,
      title: 'Витрати діяльності',
      description:
        'Рахунки класу "Витрати діяльності" застосовуються для узагальнення інформації про витрати операційної, інвестиційної, фінансової та іншої діяльності підприємства. Основні вимоги до визнання, складу та оцінки витрат викладені в Положенні (стандарті) бухгалтерського обліку 16 "Витрати".\n\nЗа дебетом рахунків цього класу відображаються суми витрат, за кредитом - списання суми витрат у кінці звітного року або щомісяця на рахунок 79 "Фінансові результати".'
    },
    {
      id: 10,
      number: 0,
      title: 'Позабалансові рахунки',
      description:
        "Позабалансові рахунки призначені для узагальнення інформації про наявність і рух:\n\nцінностей, що не належать підприємству, але тимчасово перебувають у його користуванні, розпорядженні або на зберіганні (об'єкти оперативної (операційної) оренди основних засобів, матеріальні цінності на відповідальному зберіганні, переробці, комісії, монтажі);\n\nумовних прав і зобов'язань підприємства (застави, гарантії, зобов'язання тощо);\n\nбланків суворого обліку;\n\nсписаних активів (нестачі цінностей, дебіторська заборгованість) для спостереження за можливістю їх відшкодування винними особами (боржниками);\n\nамортизаційних відрахувань.\n\nБухгалтерський облік указаних цінностей, амортизаційних відрахувань, умовних прав і зобов'язань ведеться за простою системою, за якою записи про надходження, вибуття, використання, продаж матеріальних цінностей, бланків суворого обліку, утворення умовних прав і зобов'язань, списання з балансу майна внаслідок нестачі, псування та дебіторської заборгованості, нарахування і використання амортизаційних відрахувань проводяться тільки на одному позабалансовому рахунку з вказуванням змісту і кількісно-вартісних показників операції.\n\nТоварно-матеріальні цінності відображаються за договірною вартістю або за вартістю, що вказана у приймально-передавальних актах. Орендовані основні засоби відображаються за вартістю, що вказана в договорах оперативної (операційної) оренди. Бланки суворого обліку відображаються за умовною вартістю в установленому порядку. Умовні права й зобов'язання відображаються за вартістю, вказаною в документах про гарантії й зобов'язання.\n\nТоварно-матеріальні цінності та основні засоби, вартість яких відображена на позабалансових рахунках, підлягають інвентаризації в порядку, що діє для цінностей, відображених на балансових рахунках відповідного класу."
    },
    {
      id: 8,
      number: 8,
      title: 'Витрати за елементами',
      description:
        'Рахунки цього класу призначені для узагальнення інформації про витрати підприємства протягом звітного періоду.\n\nВитрати відображаються на рахунках бухгалтерського обліку, якщо їх оцінка може бути достовірно визначена в момент вибуття активу або збільшення зобов\'язання, які призводять до зменшення власного капіталу підприємства (крім зменшення капіталу за рахунок його вилучення або розподілу власниками).\n\nОсновні вимоги до визнання, складу та оцінки витрат викладені в <a href="https://zakon.rada.gov.ua/laws/show/z0027-00">Положенні (стандарті) бухгалтерського обліку 16 "Витрати"</a>.\n\nНа рахунках цього класу, крім рахунку 85 "Інші затрати", ведеться облік витрат операційної діяльності за такими елементами витрат: матеріальні витрати, витрати на оплату праці, відрахування на соціальні заходи, амортизація та інші операційні витрати. Рахунок 85 застосовується для узагальнення інформації про витрати, пов\'язані з інвестиційною та фінансовою діяльністю, а також про інші витрати діяльності.'
    }
  ],
  accountsRequestStatus: 'idle'
};
