import { ISubAccountsRecordsState } from './index';

export const subAccountsInitialState: ISubAccountsRecordsState = {
  subAccounts: [
    {
      id: 1,
      number: 100,
      title: 'Інвестиційна нерухомість',
      description:
        'На субрахунку 100 "Інвестиційна нерухомість" ведеться облік наявності та руху об\'єктів інвестиційної нерухомості. На субрахунку 101 "Земельні ділянки" ведеться облік земельних ділянок.',
      syntheticAccountId: 10
    },
    {
      id: 2,
      number: 101,
      title: 'Земельні ділянки',
      description:
        'На субрахунку 102 "Капітальні витрати на поліпшення земель" ведеться облік капітальних вкладень у поліпшення земель (меліоративні',
      syntheticAccountId: 10
    },
    {
      id: 3,
      number: 103,
      title: 'Будинки та споруди',
      description:
        'На субрахунку 103 "Будинки та споруди" ведеться облік наявності та руху будинків',
      syntheticAccountId: 10
    },
    {
      id: 4,
      number: 104,
      title: 'Машини та обладнання',
      description:
        'На субрахунках 104 "Машини та обладнання" ведеться облік відповідно машин та обладнання',
      syntheticAccountId: 10
    },
    {
      id: 5,
      number: 105,
      title: 'Транспортні засоби',
      description:
        'На субрахунках 105 "Транспортні засоби" ведеться облік відповідно машин та обладнання',
      syntheticAccountId: 10
    },
    {
      id: 6,
      number: 106,
      title: 'Інструменти, прилади та інвентар',
      description:
        'На субрахунках 106 "Інструменти, прилади та інвентар" ведеться облік відповідно машин та обладнання, транспортних засобів, інструментів, приладів та інвентарю.',
      syntheticAccountId: 10
    },
    {
      id: 7,
      number: 107,
      title: 'Тварини',
      description:
        'На субрахунках 107 "Тварини" ведеться облік довгострокових біологічних активів',
      syntheticAccountId: 10
    },
    {
      id: 8,
      number: 108,
      title: 'Багаторічні насадження',
      description:
        'На субрахунках 108 "Багаторічні насадження" ведеться облік довгострокових біологічних активів',
      syntheticAccountId: 10
    },
    {
      id: 9,
      number: 109,
      title: 'Інші основні засоби',
      description:
        'На субрахунку 109 "Інші основні засоби" ведеться облік основних засобів',
      syntheticAccountId: 10
    }
  ],
  subAccountsRequestStatus: 'idle'
};
